## Plan Result (prod_gaps2 - TerraformPlanApply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.storage_primary_key
  * module.storage_account.azurerm_private_endpoint.dfs_endpoint[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.storage_primary_key will be created
  + resource "azurerm_key_vault_secret" "storage_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/gaps2-prod-rg/providers/Microsoft.KeyVault/vaults/gaps2-kv-prod"
      + name                    = "hmctsgaps2prodsftp-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.storage_account.azurerm_private_endpoint.dfs_endpoint[0] will be created
  + resource "azurerm_private_endpoint" "dfs_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "hmctsgaps2prodsftp-dfs"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "jumpbox-prod-rg"
      + subnet_id                = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/jumpbox-prod-rg/providers/Microsoft.Network/virtualNetworks/jumpbox-prod-vnet/subnets/gaps2-subnet"
      + tags                     = {
          + "application"  = "gaps2"
          + "builtFrom"    = "hmcts/gaps2-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "dfs-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "hmctsgaps2prodsftp-dfs"
          + private_connection_resource_id = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/gaps2-prod-rg/providers/Microsoft.Storage/storageAccounts/hmctsgaps2prodsftp"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":10,"Program":"tfcmt","SHA1":"","Target":"prod_gaps2 - TerraformPlanApply","Vars":{}} -->